; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-6-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s1)
	(empty truck6)
	(at package1 s2)
	(at package2 s0)
	(at package3 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s2)
	(link s2 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s0)
	(at truck1 s0)
	(at truck3 s2)
	(at truck4 s1)
	(at truck6 s1)
	(at package1 s1)
	(at package2 s1)
	(at package3 s0)
	))


)

; plan
1. (walk driver3 s2 p2-0)
   deleted: (at driver3 s2)
   added: (at driver3 p2-0)
   goals met: 2 of 10
2. (walk driver3 p2-0 s0)
   deleted: (at driver3 p2-0)
   added: (at driver3 s0)
   goals met: 3 of 10
3. (walk driver2 s2 p2-0)
   deleted: (at driver2 s2)
   added: (at driver2 p2-0)
   goals met: 2 of 10
4. (walk driver2 p2-0 s0)
   deleted: (at driver2 p2-0)
   added: (at driver2 s0)
   goals met: 2 of 10
5. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 2 of 10
6. (load-truck package2 truck4 s0)
   deleted: (at package2 s0)
   added: (in package2 truck4)
   goals met: 2 of 10
7. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 2 of 10
8. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 2 of 10
9. (drive-truck truck4 s0 s1 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 3 of 10
10. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 3 of 10
11. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 3 of 10
12. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 10
13. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 3 of 10
14. (drive-truck truck3 s1 s2 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 4 of 10
15. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 5 of 10
16. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 6 of 10
17. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 7 of 10
18. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 8 of 10
19. (unload-truck package2 truck4 s1)
   deleted: (in package2 truck4)
   added: (at package2 s1)
   goals met: 9 of 10
20. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 10 of 10
